package redittai.com.hanoalknots;

import android.content.Intent;
import android.graphics.drawable.Drawable;
import android.os.Handler;
import android.provider.ContactsContract;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.widget.ImageView;

import java.util.ArrayList;

public class splash extends AppCompatActivity {
    private static final int PROGRESS = 0x1;
    public final static int SPLASH_DELAY_TIME = 3000;
    // creating the list of knot objects
    public static ArrayList<knots> myList = new ArrayList<knots>();
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_splash);

        Handler handler = new Handler();
        handler.postDelayed(new Runnable() {
            @Override
            public void run() {
                Intent in1 = new Intent(getApplicationContext(),enterActivity.class);
                startActivity(in1);

            }
        },SPLASH_DELAY_TIME );
        // drawable objects of the images
        Drawable mot =getResources().getDrawable(R.drawable.mot);
        Drawable square =getResources().getDrawable(R.drawable.square);
        Drawable trypod =getResources().getDrawable(R.drawable.trypod);
        Drawable cross =getResources().getDrawable(R.drawable.cross);
        Drawable carrick =getResources().getDrawable(R.drawable.carrick);
        Drawable flat =getResources().getDrawable(R.drawable.flat);
        Drawable paralel =getResources().getDrawable(R.drawable.paralel);

        //adding the knots to the list- provided by taltal
        String trypodS = "1. הנח 3 סנדות כאשר הבסיסים שווים. את הכפיתה מבצעים על החלק העליון של הסנדות, חשוב להשאיר מקום מעל הכפיתה על מנת שהכפיתה לא תחליק.\n" +
                "\n" +
                "2. מבצעים קשר מוט על הסנדה השמאלית. מעבירים את החבל מעל הסנדה המרכזית ומתחת לימנית.\n" +
                "\n" +
                "3. מקיפים את הסנדה הימנית, עוברים מתחת לסנדה האמצעית ומעל לשמאלית. חשוב להקפיד משך כל הזמן שהחבל מתוח והכפיתה צמודה כדי שתהייה כמה שיותר חזקה.\n" +
                "\n" +
                "4. חוזרים על מבנה התפירה (למעלה-למטה) עד שכל סנדה מוקפת 3 פעמים בחבל.\n" +
                "\n" +
                "5. חונקים את הכפיתה פעם ראשונה. החניקה נעשית ע\"י ליפוף החבל סביב הכפיתה ברווח שבין שתי סנדות ומתיחת החבל. \n" +
                "6. חונקים באותו המקום פעם שנייה.\n" +
                "\n" +
                "\n" +
                " \n" +
                " 7. המשיכו בחניקות, ואחרי כל חניקה מתחו את החבל כמה שניתן. בצעו בין 2 ל-4 חניקות, בהתאם לעובי החבל. אם החניקות עולות אחת על השניה, הן מאבדות את יעילותן ואפילו מחלישות את החבל והכפיתה. אין טעם לבצע יותר מ-4 חניקות.\n" +
                "\n" +
                "8. לאחר החניקות, הקף בעזרת הקצה העובד את אחת הסנדות - העבר את הקצה מתחת לסנדה הלאה ממך, והחזר אותו לכוונך מעל הסנדה, כמו בתמונה. הצלב את הקצה עם החבל שבסוף החניקות, כאשר הקצה העובד עובר מלמעלה, וצור צורת X.\n" +
                "9. הקף שוב את הסנדה - העבר את הקצה העובד מתחת לסנדה הלאה ממך, והחזר אותו לכוונך מעל הסנדה. העבר את הקצה מתחת ל-X דרך מרכזו (למעשה, צור קביעת מוט).\n" +
                "\n" +
                "\n" +
                "\n" +
                "10. הדק את הקביעה. הקביעה שבתחילת הכפיתה ובסופה אינה למעשה חלק ישיר מהכפיתה, אך היא הכרחית לשמירה על החבל שלא יחליק. כל קביעה יכולה להתאים, אך קביעת מוט היא הנפוצה ביותר לשימוש זה, לכן אנו משתמשים בה בהסברים. בסוף הקביעה קשור אבטחת בהן.\n" +
                "\n" +
                "11. בסוף הכפיתה נשאר בדרך כלל קטע חבל מסויים מיותר. קטע זה עלול להפריע להמשך העבודה, ולעיתים אף לגרום לסכנה. אנו איננו תומכים בחיתוך החבל, ולכן מציעים פתרון אחר: לפף את החבל סביב הסנדה. לבסוף, בכדי שלא ישתחררו הליפופים, העבר את קצה החבל העובד דרך הלפוף שלפניו (חצי קביעה).\n";
        // cross knot!
        String Scross = "1. הנח את שתי הסנדות בזוית הרצויה. קשור קביעת מוט על אחת מהן.\n" +
                "\n" +
                "2. בין הסנדות נוצרות 4 זויות: 2 חדות ו-2 כהות. לפף את החבל סביב שתי הסנדות דרך הזויות הכהות, כמו בתמונה:\n" +
                "3. המשך ללפף את החבל מספר פעמים דרך הזויות הכהות. מספר הליפופים תלוי בזוית - ככל שהיא יותר כהה כך נדרשים יותר ליפופים. אין טעם ללפף יותר מדי, ומעט מדי ליפופים עלולים להחליש את הכפיתה. בדרך כלל מספר הליפופים הוא כ-6. לאחר מכן העבר את החבל דרך הזוית החדה.\n" +
                "\n" +
                "4. הקף את שתי הסנדות בעזרת החבל, הפעם דרך הזוית החדה.\n";
        // square knot!
        String Ssquare = "1.הנח את שתי הסנדות במאונך אחת לשניה. קשור קביעת מוט על אחת מהן.\n" +
                "2. הקף עם הקצה העובד את הצטלבות הסנדות. כל פעם שיפגוש החבל את הסנדה העליונה, הוא יעבור מעליה, וכל פעם שיפגוש את התחתונה הוא יעבור מתחתיה, כמו בתמונה.\n" +
                "\n" +
                "3. על הסנדה העליונה נוצרים שני חבלים מקבילים, מאונכים. המשך להקיף את הצטלבות הסנדות באותה דרך. שים לב: כאשר עובר החבל בין שני החבלים המקבילים שמעל הסנדה, הוא יעבור ביניהם, כמו בתמונה.\n" +
                "4. גם מתחת לסנדה התחתונה נוצרים שני חבלים מקבילים, מאוזנים. המשך להקיף את הצטלבות הסנדות. כאשר עובר החבל מתחת לסנדה התחתונה, הוא יעבור מחוץ למקבילים המאוזנים.\n" +
                "\n" +
                "5. המשך להקיף עד שתסיים 4 הקפות. השתדל לשמור על החבל מתוח כמה שאפשר, והמשך לשים לב להעביר את החבל בין המקבילים מעל ומחוץ למקבילים למטה.\n" +
                "6. השלב הבא - 'חניקות'. מטרת החניקות היא למתוח את ההקפות שנעשו עד עתה. ניתן לשים לב כי בהקפות עצמן נשענו החבלים על הסנדות, ואילו כאן ישענו החניקות על החבל. הקף את הצטלבות הסנדות, הפעם בכיוון ההפוך מכיוון ההקפות עד עכשיו. הפעם, כאשר החבל יפגוש בסנדה העליונה, הוא יעבור מתחתיה, וכאשר הוא יפגוש בסנדה התחתונה הוא יעבור מעליה, כמו בתמונה.\n";
        // paralel knot!
        String Sparalel = "1. הצמד את שתי הסנדות (או הסנדה והבזנ\"ט) אחד לשני. קשור סביב שניהם יחד קביעת מוט. חשוב לציין: במקרה של חיבור שתי סנדות חשוב שאורך האזור החופף בין שתי הסנדות (בו הן צמודות אחת לצד השניה) יהיה באורך שליש מאורך הסנדות. צור קפל, הפונה כלפי מעלה (כמו בתמונה).\n" +
                "\n" +
                "2. הקף בעזרת הקצה העובד של החבל את הסנדות מלמטה, והשחל אותו אל תוך הקפל (למעשה - צור חצי קביעה).\n" +
                "3. הדק את חצי הקביעה.\n" +
                "\n" +

                "4. צור, באותה שיטה, חצאי קביעות נוספים. אם הכפיתה נעשית נכון, יווצר \"נחש\" שיקיף בספירלה את הסנדות.\n" +
                "5. המשך בחצאי הקביעות. יש לעשות לפחות 10 חצאי קביעות. אם נותר עוד חבל - ניתן להמשיך עד שיהיה קשור כולו. מכיוון ששני חצאי קביעות הינם קשר מוט, אין צורך לעשות קשר מוט בסוף הכפיתה (הוא נוצר מעצמו). אבטח את הכפיתה באבטחה מתאימה (בתמונה - אבטחת שמיניות).\n";
        knots k1 = new knots("פלטת קאריק","O2LQE6tHRzQ","creating a hot trey mat or a decoration","פלטה שטוחה לקישוט או להנחת סירים",carrick);
        myList.add(k1);
        knots k2= new knots("קשר שטוח","FWP2xCGeBxw","conecting two ropes","משמש לחיבור בין שני קצוות חבל",flat);
        myList.add(k2);
        knots k3 = new knots("קשר מוט","aewgmUeHpuE","begining a resreint on a pole","משמש לחיבור קצה חבל לסנדה",mot);
        myList.add(k3);
        knots k4 = new knots("כפיתה מקבילה","1234",Sparalel,"כפיתה שנועדה לחבר בין שתי סנדות",paralel);
        myList.add(k4);
        knots k5 = new knots("כפיתה מרובעת","FWP2xCGeBxw",Ssquare,"כפיתה בסיסית המשמשת לחיבור שתי סנדתו במאונך",square);
        myList.add(k5);
        knots k6 = new knots("כפיתה מוצלבת","FWP2xCGeBxw",Scross,"כפיתה בסיסית המשמשת לחיבור שתי סנדות בזווית שאינה ישרה אחת לשניה ",cross);
        myList.add(k6);
        knots k7 = new knots("כפיתת חצובה","zwHUgQhUgrc",trypodS,"כפיתה אשר משמשת לכפיתת סנדות לחצובה באופן יציב ובטוח",trypod);
        myList.add(k7);

    }
}
